{"backend": "tensorflow", "config": [{"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_7", "padding": "same", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_8", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_9", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_10", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_11", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_12", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"units": 512, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"units": 10, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6"}