{"config": [{"config": {"kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "batch_input_shape": [null, 28, 28, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_2", "activation": "relu", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_3", "activation": "relu", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_4", "activation": "relu", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_5", "activation": "relu", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_6", "activation": "relu", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "activation": "relu", "units": 512, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_4", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "name": "dense_2", "activation": "softmax", "units": 10, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6"}